experiment_data/ycsb/Tapir/run-rper100-hst6-srv3-thr6-this5.log
YCSB Client 0.1
Command line: -P workloads/workload100 -t -db com.yahoo.ycsb.db.TapirClient -s -p tapir.configpath=../store/tools/shard -p tapir.nshards=8 -p tapir.closestreplica=2 -p measurement.type=histogram -p histogram.buckets=25 -threads 6 -p operationcount=150000
Loading workload...
Starting test.
 0 sec: 0 operations; 
 10 sec: 18000 operations; 1795.69 current ops/sec; [READ AverageLatency(us)=991.81] [COMMIT AverageLatency(us)=2320.85] [START AverageLatency(us)=1] 
 20 sec: 36327 operations; 1832.15 current ops/sec; [READ AverageLatency(us)=977.63] [COMMIT AverageLatency(us)=2290.01] [START AverageLatency(us)=0.97] 
 30 sec: 54873 operations; 1854.41 current ops/sec; [READ AverageLatency(us)=979.47] [COMMIT AverageLatency(us)=2249.19] [START AverageLatency(us)=0.98] 
 40 sec: 73437 operations; 1856.21 current ops/sec; [READ AverageLatency(us)=950.92] [COMMIT AverageLatency(us)=2275.44] [START AverageLatency(us)=0.98] 
 50 sec: 91731 operations; 1829.22 current ops/sec; [READ AverageLatency(us)=987.5] [COMMIT AverageLatency(us)=2287.37] [START AverageLatency(us)=0.98] 
 60 sec: 110190 operations; 1845.9 current ops/sec; [READ AverageLatency(us)=954.93] [COMMIT AverageLatency(us)=2290.42] [START AverageLatency(us)=0.96] 
 70 sec: 128761 operations; 1856.91 current ops/sec; [READ AverageLatency(us)=943.82] [COMMIT AverageLatency(us)=2282.81] [START AverageLatency(us)=0.98] 
 80 sec: 149996 operations; 2123.29 current ops/sec; [READ AverageLatency(us)=802.34] [COMMIT AverageLatency(us)=1928.52] [START AverageLatency(us)=0.96] 
 80 sec: 150000 operations; 800 current ops/sec; [READ AverageLatency(us)=311] [COMMIT AverageLatency(us)=1136.75] [START AverageLatency(us)=1] 
Database validation succeeded
[OVERALL], RunTime(ms), 80037.0
[OVERALL], Throughput(ops/sec), 1874.1332133888077
[READ], Operations, 150000
[READ], AverageLatency(us), 945.6527666666667
[READ], MinLatency(us), 169
[READ], MaxLatency(us), 16847
[READ], 95thPercentileLatency(ms), 3
[READ], 99thPercentileLatency(ms), 6
[READ], Return=0, 150000
[READ], 0, 110929
[READ], 1, 20738
[READ], 2, 8493
[READ], 3, 4438
[READ], 4, 2355
[READ], 5, 1400
[READ], 6, 781
[READ], 7, 406
[READ], 8, 222
[READ], 9, 124
[READ], 10, 62
[READ], 11, 34
[READ], 12, 12
[READ], 13, 5
[READ], 14, 0
[READ], 15, 0
[READ], 16, 1
[READ], 17, 0
[READ], 18, 0
[READ], 19, 0
[READ], 20, 0
[READ], 21, 0
[READ], 22, 0
[READ], 23, 0
[READ], 24, 0
[READ], >25, 0
[COMMIT], Operations, 150000
[COMMIT], AverageLatency(us), 2234.494706666667
[COMMIT], MinLatency(us), 1012
[COMMIT], MaxLatency(us), 505982
[COMMIT], 95thPercentileLatency(ms), 6
[COMMIT], 99thPercentileLatency(ms), 8
[COMMIT], Return=0, 150000
[COMMIT], 0, 0
[COMMIT], 1, 98692
[COMMIT], 2, 19733
[COMMIT], 3, 11795
[COMMIT], 4, 7400
[COMMIT], 5, 4796
[COMMIT], 6, 3107
[COMMIT], 7, 1912
[COMMIT], 8, 1181
[COMMIT], 9, 652
[COMMIT], 10, 369
[COMMIT], 11, 174
[COMMIT], 12, 99
[COMMIT], 13, 55
[COMMIT], 14, 20
[COMMIT], 15, 7
[COMMIT], 16, 4
[COMMIT], 17, 0
[COMMIT], 18, 1
[COMMIT], 19, 0
[COMMIT], 20, 1
[COMMIT], 21, 0
[COMMIT], 22, 0
[COMMIT], 23, 0
[COMMIT], 24, 0
[COMMIT], >25, 2
[START], Operations, 150000
[START], AverageLatency(us), 0.97662
[START], MinLatency(us), 0
[START], MaxLatency(us), 40
[START], 95thPercentileLatency(ms), 0
[START], 99thPercentileLatency(ms), 0
[START], Return=0, 150000
[START], 0, 150000
[START], 1, 0
[START], 2, 0
[START], 3, 0
[START], 4, 0
[START], 5, 0
[START], 6, 0
[START], 7, 0
[START], 8, 0
[START], 9, 0
[START], 10, 0
[START], 11, 0
[START], 12, 0
[START], 13, 0
[START], 14, 0
[START], 15, 0
[START], 16, 0
[START], 17, 0
[START], 18, 0
[START], 19, 0
[START], 20, 0
[START], 21, 0
[START], 22, 0
[START], 23, 0
[START], 24, 0
[START], >25, 0