experiment_data/ycsb/Tapir/run-rper50-hst3-srv3-thr3-this0.log
YCSB Client 0.1
Command line: -P workloads/workload50 -t -db com.yahoo.ycsb.db.TapirClient -s -p tapir.configpath=../store/tools/shard -p tapir.nshards=8 -p tapir.closestreplica=0 -p measurement.type=histogram -p histogram.buckets=25 -threads 3 -p operationcount=300000
Loading workload...
Starting test.
 0 sec: 0 operations; 
 10 sec: 18702 operations; 1866.65 current ops/sec; [READ AverageLatency(us)=350.8] [COMMIT AverageLatency(us)=1231.99] [START AverageLatency(us)=1] [UPDATE AverageLatency(us)=362.88] 
 20 sec: 37647 operations; 1893.93 current ops/sec; [READ AverageLatency(us)=339.49] [COMMIT AverageLatency(us)=1231.5] [START AverageLatency(us)=0.98] [UPDATE AverageLatency(us)=349] 
 30 sec: 57093 operations; 1944.6 current ops/sec; [READ AverageLatency(us)=334.32] [COMMIT AverageLatency(us)=1198.12] [START AverageLatency(us)=0.97] [UPDATE AverageLatency(us)=339.32] 
 40 sec: 75587 operations; 1849.22 current ops/sec; [READ AverageLatency(us)=331.56] [COMMIT AverageLatency(us)=1278.08] [START AverageLatency(us)=0.93] [UPDATE AverageLatency(us)=343.67] 
 50 sec: 94921 operations; 1933.4 current ops/sec; [READ AverageLatency(us)=335.78] [COMMIT AverageLatency(us)=1204.91] [START AverageLatency(us)=0.91] [UPDATE AverageLatency(us)=346.1] 
 60 sec: 114301 operations; 1937.81 current ops/sec; [READ AverageLatency(us)=335.08] [COMMIT AverageLatency(us)=1201.98] [START AverageLatency(us)=0.9] [UPDATE AverageLatency(us)=344.94] 
 70 sec: 133327 operations; 1902.41 current ops/sec; [READ AverageLatency(us)=337] [COMMIT AverageLatency(us)=1231.81] [START AverageLatency(us)=0.89] [UPDATE AverageLatency(us)=342.07] 
 80 sec: 152422 operations; 1909.5 current ops/sec; [READ AverageLatency(us)=333.93] [COMMIT AverageLatency(us)=1225.65] [START AverageLatency(us)=0.88] [UPDATE AverageLatency(us)=345.59] 
 90 sec: 171747 operations; 1932.31 current ops/sec; [READ AverageLatency(us)=334.29] [COMMIT AverageLatency(us)=1206.07] [START AverageLatency(us)=0.87] [UPDATE AverageLatency(us)=347.34] 
 100 sec: 190435 operations; 1868.61 current ops/sec; [READ AverageLatency(us)=337.65] [COMMIT AverageLatency(us)=1259.27] [START AverageLatency(us)=0.87] [UPDATE AverageLatency(us)=343.46] 
 110 sec: 209615 operations; 1917.81 current ops/sec; [READ AverageLatency(us)=338.49] [COMMIT AverageLatency(us)=1216.14] [START AverageLatency(us)=0.88] [UPDATE AverageLatency(us)=346.7] 
 120 sec: 228672 operations; 1905.7 current ops/sec; [READ AverageLatency(us)=336.29] [COMMIT AverageLatency(us)=1230.96] [START AverageLatency(us)=0.88] [UPDATE AverageLatency(us)=339.29] 
 130 sec: 248379 operations; 1970.5 current ops/sec; [READ AverageLatency(us)=316.59] [COMMIT AverageLatency(us)=1195.9] [START AverageLatency(us)=0.87] [UPDATE AverageLatency(us)=325.47] 
 140 sec: 268356 operations; 1997.5 current ops/sec; [READ AverageLatency(us)=317.67] [COMMIT AverageLatency(us)=1174.17] [START AverageLatency(us)=0.86] [UPDATE AverageLatency(us)=326.16] 
 150 sec: 288339 operations; 1998.3 current ops/sec; [READ AverageLatency(us)=319.85] [COMMIT AverageLatency(us)=1174.19] [START AverageLatency(us)=0.86] [UPDATE AverageLatency(us)=323.96] 
 156 sec: 300000 operations; 1777.32 current ops/sec; [READ AverageLatency(us)=292.89] [COMMIT AverageLatency(us)=1138.84] [START AverageLatency(us)=0.87] [UPDATE AverageLatency(us)=310.02] 
Database validation succeeded
[OVERALL], RunTime(ms), 156591.0
[OVERALL], Throughput(ops/sec), 1915.8189167959845
[READ], Operations, 149684
[READ], AverageLatency(us), 331.5535394564549
[READ], MinLatency(us), 147
[READ], MaxLatency(us), 6957
[READ], 95thPercentileLatency(ms), 0
[READ], 99thPercentileLatency(ms), 1
[READ], Return=0, 149684
[READ], 0, 147820
[READ], 1, 1736
[READ], 2, 47
[READ], 3, 51
[READ], 4, 29
[READ], 5, 0
[READ], 6, 1
[READ], 7, 0
[READ], 8, 0
[READ], 9, 0
[READ], 10, 0
[READ], 11, 0
[READ], 12, 0
[READ], 13, 0
[READ], 14, 0
[READ], 15, 0
[READ], 16, 0
[READ], 17, 0
[READ], 18, 0
[READ], 19, 0
[READ], 20, 0
[READ], 21, 0
[READ], 22, 0
[READ], 23, 0
[READ], 24, 0
[READ], >25, 0
[COMMIT], Operations, 300000
[COMMIT], AverageLatency(us), 1213.7653333333333
[COMMIT], MinLatency(us), 1028
[COMMIT], MaxLatency(us), 508603
[COMMIT], 95thPercentileLatency(ms), 1
[COMMIT], 99thPercentileLatency(ms), 1
[COMMIT], Return=0, 300000
[COMMIT], 0, 0
[COMMIT], 1, 297437
[COMMIT], 2, 592
[COMMIT], 3, 362
[COMMIT], 4, 143
[COMMIT], 5, 45
[COMMIT], 6, 77
[COMMIT], 7, 185
[COMMIT], 8, 1112
[COMMIT], 9, 24
[COMMIT], 10, 7
[COMMIT], 11, 2
[COMMIT], 12, 1
[COMMIT], 13, 1
[COMMIT], 14, 1
[COMMIT], 15, 0
[COMMIT], 16, 1
[COMMIT], 17, 0
[COMMIT], 18, 0
[COMMIT], 19, 0
[COMMIT], 20, 0
[COMMIT], 21, 0
[COMMIT], 22, 0
[COMMIT], 23, 0
[COMMIT], 24, 0
[COMMIT], >25, 10
[START], Operations, 300000
[START], AverageLatency(us), 0.9020333333333334
[START], MinLatency(us), 0
[START], MaxLatency(us), 50
[START], 95thPercentileLatency(ms), 0
[START], 99thPercentileLatency(ms), 0
[START], Return=0, 300000
[START], 0, 300000
[START], 1, 0
[START], 2, 0
[START], 3, 0
[START], 4, 0
[START], 5, 0
[START], 6, 0
[START], 7, 0
[START], 8, 0
[START], 9, 0
[START], 10, 0
[START], 11, 0
[START], 12, 0
[START], 13, 0
[START], 14, 0
[START], 15, 0
[START], 16, 0
[START], 17, 0
[START], 18, 0
[START], 19, 0
[START], 20, 0
[START], 21, 0
[START], 22, 0
[START], 23, 0
[START], 24, 0
[START], >25, 0
[UPDATE], Operations, 150316
[UPDATE], AverageLatency(us), 340.3261595571995
[UPDATE], MinLatency(us), 156
[UPDATE], MaxLatency(us), 8731
[UPDATE], 95thPercentileLatency(ms), 0
[UPDATE], 99thPercentileLatency(ms), 1
[UPDATE], Return=0, 150316
[UPDATE], 0, 148201
[UPDATE], 1, 1970
[UPDATE], 2, 66
[UPDATE], 3, 44
[UPDATE], 4, 29
[UPDATE], 5, 4
[UPDATE], 6, 1
[UPDATE], 7, 0
[UPDATE], 8, 1
[UPDATE], 9, 0
[UPDATE], 10, 0
[UPDATE], 11, 0
[UPDATE], 12, 0
[UPDATE], 13, 0
[UPDATE], 14, 0
[UPDATE], 15, 0
[UPDATE], 16, 0
[UPDATE], 17, 0
[UPDATE], 18, 0
[UPDATE], 19, 0
[UPDATE], 20, 0
[UPDATE], 21, 0
[UPDATE], 22, 0
[UPDATE], 23, 0
[UPDATE], 24, 0
[UPDATE], >25, 0